# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [ -1, 1, MobileNetv4, [ 64,1,"MNV4ConvSmall",1 ] ] #0  80
  - [ -1, 1, MobileNetv4, [ 96,2,"MNV4ConvSmall",1 ] ] #1  40
  - [ -1, 1, MobileNetv4, [ 128,3,"MNV4ConvSmall",1 ] ] #2  20
  - [-1, 1, SPPF, [1024, 5]] # 3
  - [-1, 1, PSA, [1024]] # 4

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 0], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 13 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
